app/controllers/books_controller.rb

      def create
        @book = Book.new(book_params)
        Rails.logger.debug "Book object before save: #{@book.inspect}"
        if @book.save
---
INSERT INTO "books" ("title", "author", "description", "datePublished", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"